In [1]:
import pandas as pd
import numpy as np

In [4]:
#Create a dictionary with some different data types as values
my_dict = {"name" : ["Joe", "Bob", "Frans"],     #list
           "age" : np.array([10,15,20]),         #array(numpy)
           "weight" : (75,123,239),                #tuple
           "height" : pd.Series([4.5, 5, 6.1],    #panda series
                                index=["Joe", "Bob", "Frans"]),
           "siblings" : 1,
           "gender" : "M"}
df = pd.DataFrame(my_dict)         #convert the dict to DataFrame
df

        name  age  weight  height  siblings gender
Joe      Joe   10      75     4.5         1      M
Bob      Bob   15     123     5.0         1      M
Frans  Frans   20     239     6.1         1      M

In [6]:
my_dict2 ={"name" : ["Joe", "Bob", "Frans"],     #list
           "age" : np.array([10,15,20]),         #array(numpy)
           "weight" : (75,123,239),                #tuple
           "height" : [4.5, 5, 6.1],    #list
           "siblings" : 1,
           "gender" : "M"}
df2 = pd.DataFrame(my_dict2)         #convert the dict to DataFrame
df2

    name  age  weight  height  siblings gender
0    Joe   10      75     4.5         1      M
1    Bob   15     123     5.0         1      M
2  Frans   20     239     6.1         1      M

In [8]:
#indexing with column name
df2 = pd.DataFrame(my_dict2,
                   index = my_dict["name"])
df2

        name  age  weight  height  siblings gender
Joe      Joe   10      75     4.5         1      M
Bob      Bob   15     123     5.0         1      M
Frans  Frans   20     239     6.1         1      M

In [10]:
#df2["weight"]
df2.weight

Joe       75
Bob      123
Frans    239
Name: weight, dtype: int64

In [12]:
#del df2['name']

In [14]:
#adding a new column
df2["IQ"] = [130, 105, 115]
df2

        name  age  weight  height  siblings gender   IQ
Joe      Joe   10      75     4.5         1      M  130
Bob      Bob   15     123     5.0         1      M  105
Frans  Frans   20     239     6.1         1      M  115

In [20]:
#adding a new column
df2["Married"] = False
df2

        name  age  weight  height  siblings gender   IQ  Married
Joe      Joe   10      75     4.5         1      M  130    False
Bob      Bob   15     123     5.0         1      M  105    False
Frans  Frans   20     239     6.1         1      M  115    False

In [26]:
#adding a new column foe one column name
df2["College"] = pd.Series(["Havard"],
                 index=["Frans"])
df2

        name  age  weight  height  siblings gender   IQ  Married College
Joe      Joe   10      75     4.5         1      M  130    False     NaN
Bob      Bob   15     123     5.0         1      M  105    False     NaN
Frans  Frans   20     239     6.1         1      M  115    False  Havard

In [28]:
df2.loc["Joe"] # select row "Joe"

name          Joe
age            10
weight         75
height        4.5
siblings        1
gender          M
IQ            130
Married     False
College       NaN
Name: Joe, dtype: object

In [30]:
df2.loc["Joe", "IQ"] # select row "Joe" and column "IQ"

130

In [32]:
df2.loc ["Joe":"Bob", "IQ":"College"]   #Slice by label

      IQ  Married College
Joe  130    False     NaN
Bob  105    False     NaN

In [44]:
df2.iloc[0, 5]   #get row 0, column 5

'M'

In [42]:
df2.iloc[0]      #get row 0

name          Joe
age            10
weight         75
height        4.5
siblings        1
gender          M
IQ            130
Married     False
College       NaN
Name: Joe, dtype: object

In [46]:
boolean_index = [False, True, True]
df2[boolean_index]

        name  age  weight  height  siblings gender   IQ  Married College
Bob      Bob   15     123     5.0         1      M  105    False     NaN
Frans  Frans   20     239     6.1         1      M  115    False  Havard

In [50]:
#create a boolean sequence with a logical comparison
boolean_index = df2["age"] > 12
df2[boolean_index] #using index to get rows  where age is 12

        name  age  weight  height  siblings gender   IQ  Married College
Bob      Bob   15     123     5.0         1      M  105    False     NaN
Frans  Frans   20     239     6.1         1      M  115    False  Havard

In [52]:
#OR
df2[ df2["age"] > 12 ]

        name  age  weight  height  siblings gender   IQ  Married College
Bob      Bob   15     123     5.0         1      M  105    False     NaN
Frans  Frans   20     239     6.1         1      M  115    False  Havard